contingent/application/contingent-area/src/test/resources/xml/searchArea2538.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:user="http://emias.mos.ru/system/v1/userContext/"
               xmlns:typ="http://emias.mos.ru/contingent2/area/v3/types/"
               xmlns:v3="http://emias.mos.ru/contingent2/core/v3/"
               xmlns:v31="http://emias.mos.ru/contingent2/address/v3/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-3">
                <wsse:Username>autotest</wsse:Username>
            </wsse:UsernameToken>
        </wsse:Security>
        <user:userContext>
            <user:systemName>UPK/UPK</user:systemName>
            <user:userName>autotest</user:userName>
            <user:userRoleId>10</user:userRoleId>
            <!--Optional:-->
            <user:isUserRoleSystemWide>false</user:isUserRoleSystemWide>
            <user:userRights>
                <!--Zero or more repetitions:-->
                <user:userRightId>320025</user:userRightId>
            </user:userRights>
            <user:jobExecutionId>100</user:jobExecutionId>
            <!--Optional:-->
            <user:hostIp>192.168.0.0</user:hostIp>
            <!--Optional:-->
            <user:hostName>serv_test</user:hostName>
        </user:userContext>
    </soap:Header>
    <soap:Body>
        <typ:searchAreaRequest>
            <!--Optional:-->
            <typ:areaTypeCode>20</typ:areaTypeCode>
            <typ:areaTypeCode>10</typ:areaTypeCode>
            <typ:isArchived>false</typ:isArchived>
            <!--Zero or more repetitions:-->
            <typ:address>
                <v31:globalIdNsi>-100</v31:globalIdNsi>
                <v31:regionOMKTEcode>-100</v31:regionOMKTEcode>
            </typ:address>
        </typ:searchAreaRequest>
    </soap:Body>
</soap:Envelope>